Repository: mayoney250/famingairrigate
Catalog: lib/l10n/app_*.arb
Languages: rw

source: Welcome Back!
rw: Murakaza neza!

# signInToManage
source: Sign in to manage your irrigation systems
rw: Injira kugirango uyobore sisitemu zawe zo kuhira

source: Email
rw: Imeyili

# enterEmail
source: Enter your email
rw: Andika imeyili yawe

source: Password
rw: Ijambo ry'ibanga

# enterPassword
source: Enter your password
rw: Andika ijambo ry'ibanga

source: Forgot Password?
rw: Wibagiwe ijambo ry'ibanga?

source: Login
rw: Injira

# dontHaveAccount
source: Don't have an account?
rw: Ntabwo ufite konti?

source: Register
rw: Iyandikishe

source: Create Account
rw: Fungura Konti

source: Join Faminga
rw: Injira muri Faminga

# startManaging
source: Start managing your irrigation smartly
rw: Tangira kuyobora sisitemu zo kuhira mu buryo bwiza

source: First Name
rw: Izina

# enterFirstName
source: Enter your first name
rw: Andika izina ryawe

source: Last Name
rw: Izina ry'umuryango

# enterLastName
source: Enter your last name
rw: Andika izina ry'umuryango

# phoneNumber
source: Phone Number (Optional)
rw: Nimero ya telefoni (Ntabwo ari ngombwa)

# enterPhoneNumber
source: Enter your phone number
rw: Andika nimero ya telefoni

source: Confirm Password
rw: Emeza ijambo ry'ibanga

# reEnterPassword
source: Re-enter your password
rw: Ongera wandike ijambo ry'ibanga

# alreadyHaveAccount
source: Already have an account?
rw: Usanzwe ufite konti?

source: Reset Password
rw: Subiza Ijambo ry'ibanga

# enterEmailForReset
source: Enter your email address and we will send you a link to reset your password
rw: Andika imeyili yawe kandi tuzakoherereza link yo guhindura ijambo ry'ibanga

source: Send Reset Link
rw: Ohereza Link

source: Dashboard
rw: Ikibaho

source: Irrigation
rw: Kuhira

source: Fields
rw: Imirima

source: Sensors
rw: Ibipimo

source: Profile
rw: Umwirondoro

source: Settings
rw: Igenamiterere

# welcomeUser
source: Welcome back!
rw: Murakaza neza!

source: Quick Actions
rw: Ibikorwa byihuse

source: Overview
rw: Incamake

source: Recent Activities
rw: Ibikorwa vya vuba

source: Active Systems
rw: Sisitemu zikora

source: Total Fields
rw: Imirima yose

source: Water Saved
rw: Amazi yakijijwe

source: Active Sensors
rw: Ibipimo bikora

source: Irrigation Systems
rw: Sisitemu zo kuhira

source: Add System
rw: Ongeraho Sisitemu

# noIrrigationSystems
source: No irrigation systems yet
rw: Nta sisitemu zo kuhira

# addFirstSystem
source: Add your first irrigation system to get started
rw: Ongeraho sisitemu yawe ya mbere yo kuhira

source: Active
rw: Irakora

source: Inactive
rw: Ntirikora

source: Type
rw: Ubwoko

source: Source
rw: Isoko

source: Mode
rw: Uburyo

source: Automated
rw: Byikora

source: Manual
rw: Mu ntoki

source: Water Used
rw: Amazi yakoreshejwe

source: Error
rw: Ikosa

source: Success
rw: Byagenze neza

source: Loading...
rw: Birapakira...

source: Refresh
rw: Ongera upakure

source: Notifications
rw: Imenyesha

# accountCreatedSuccess
source: Account created successfully. Please check your email to verify your account.
rw: Konti yarangijwe. Genzura imeyili yawe kugirango uyemeze konti yawe.

source: Email Sent
rw: Imeyili Yoherejwe

# passwordResetSent
source: Password reset link has been sent to your email. Please check your inbox.
rw: Link yo guhindura ijambo ry'ibanga yoherejwe kuri imeyili yawe. Genzura imeyili yawe.

source: OK
rw: Sawa

source: Cancel
rw: Hagarika

source: Save
rw: Bika

source: Delete
rw: Siba

source: Update
rw: Kuvugurura

source: Language
rw: Ururimi

source: Start Now
rw: Tangira Ubu

source: Go to Fields
rw: Jya ku mirima

source: No fields found.
rw: Nta murima wabonetse.

source: System Status
rw: Imiterere ya sisitemu

source: Next Schedule Cycle
rw: Icyegeranyo cya nyuma

source: Weekly Performance
rw: Imikorere y'icyumweru

source: Soil Moisture
rw: Ubushuhe bw'ubutaka

source: Average Today
rw: Impuzandengo uyumunsi

source: No scheduled irrigations
rw: Nta gahunda yo kuhira

# startIrrigationManually
source: Start irrigation manually or create a schedule
rw: Tangira kuhira mu ntoki cyangwa ukore gahunda

source: START CYCLE MANUALLY
rw: TANGIRA ICYEGERANYO MU NTOKI

source: Water Usage
rw: Ikoreshwa ry'amazi

source: Liters this week
rw: Litiro muri iki cyumweru

source: KSh Saved
rw: KSh Yakijijwe

source: This week
rw: Iki cyumweru

# noFieldsTitle
source: No Fields Found
rw: Nta murima wabonetse

# noFieldsMessage
source: You don't have any fields registered. Please create a field first to start manual irrigation.
rw: Ntabwo ufite umurima wanditswe. Nyamuneka tangira uhindure umurima kugirango utangire kuhira mu ntoki.

source: Alerts
rw: Imenyesha

source: Mark as read
rw: Shyira nk'ibisomwe

source: No alerts yet
rw: Nta menyesha ubu

source: Just now
rw: Ubu

# minutesAgo
source: {minutes}min ago
rw: Iminota {minutes} ishize

# hoursAgo
source: {hours}h ago
rw: Amasaha {hours} ashize

# daysAgo
source: {days}d ago
rw: Iminsi {days} ishize

source: Manual Start
rw: Gutangira mu ntoki

source: Farm Info
rw: Amakuru y'umurima

source: Scheduled
rw: Byateganijwe
